DataProcessors/КлонированиеМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>КлонированиеМаршрутов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйПеревозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КлонируемыеМаршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обрабатывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/КлонированиеМаршрутов/Forms/Форма/Ext/Form/Module.bsl
//+++АК sole 2018.08.02 ИП-00019229
&НаКлиенте
Процедура ЗаполнитьМаршрутыДляКлонирования(Команда)
	ЗаполнитьМаршрутыДляКлонирования_НаСервере();	
КонецПроцедуры

//+++АК sole 2018.08.02 ИП-00019229
&НаСервере
Процедура ЗаполнитьМаршрутыДляКлонирования_НаСервере()
	
	Перем Запрос;
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос();

	Запрос.Текст =
"ВЫБРАТЬ
|	Истина КАК Обрабатывать,
|	Маршруты.Ссылка КАК Маршрут
|
|ИЗ Справочник.Маршруты КАК Маршруты
|ГДЕ	
|		НЕ Маршруты.ПометкаУдаления
|	И	Маршруты.Перевозчик = &Перевозчик
|
|УПОРЯДОЧИТЬ ПО Маршруты.Наименование
|";
	Запрос.УстановитьПараметр("Перевозчик", Объект.Перевозчик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НСтр = ЭтаФорма.Объект.КлонируемыеМаршруты.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Выборка); 
	КонецЦикла;
	
КонецПроцедуры

//+++АК sole 2018.08.02 ИП-00019229
&НаКлиенте
Процедура ПеревозчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ФормаВыбора = ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораУправляемая",, Элемент);
	ОсновнойОтбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОсновнойОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОсновнойОтбор.Использование = Истина;
	ОсновнойОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	ОсновнойОтбор.ПравоеЗначение = ПолучитьСсылкуГруппаКонтрагентовТранспорт();
	
	ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры

//+++АК sole 2018.08.02 ИП-00019229
&НаСервере
Функция ПолучитьСсылкуГруппаКонтрагентовТранспорт()
	Возврат Справочники.Контрагенты.НайтиПоКоду("000000519");		
КонецФункции

//+++АК sole 2018.08.02 ИП-00019229
&НаСервере
Процедура ВыделитьВсё_НаСервере()
	
	Для Каждого Стр Из Объект.КлонируемыеМаршруты Цикл
		Стр["Обрабатывать"] = Истина;	
	КонецЦикла;

КонецПроцедуры

//+++АК sole 2018.08.02 ИП-00019229
&НаКлиенте
Процедура ВыделитьВсё(Команда)
	ВыделитьВсё_НаСервере();
КонецПроцедуры

//+++АК sole 2018.08.02 ИП-00019229
&НаСервере
Процедура СнятьВыделение_НаСервере()
	
	Для Каждого Стр Из Объект.КлонируемыеМаршруты Цикл
		Стр["Обрабатывать"] = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

//+++АК sole 2018.08.02 ИП-00019229
&НаКлиенте
Процедура СнятьВыделение(Команда)
	СнятьВыделение_НаСервере();
КонецПроцедуры

//+++АК sole 2018.08.02 ИП-00019229
&НаКлиенте
Процедура НовыйПеревозчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ФормаВыбора = ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораУправляемая",, Элемент);
	ОсновнойОтбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОсновнойОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОсновнойОтбор.Использование = Истина;
	ОсновнойОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	ОсновнойОтбор.ПравоеЗначение = ПолучитьСсылкуГруппаКонтрагентовТранспорт();
	
	ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	
КонецПроцедуры

//+++АК sole 2018.08.02 ИП-00019229
&НаСервере
Процедура Клонировать_НаСервере()
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.КлонироватьМаршруты();
	
КонецПроцедуры

//+++АК sole 2018.08.02 ИП-00019229
&НаКлиенте
Процедура Клонировать(Команда)
	Клонировать_НаСервере();
КонецПроцедуры
